{
    "id": "js-array-method",
    "title": "জাভাস্ক্রিপ্ট অ্যারে মেথড",
    "slug": "js-array-method",
    "description": "জাভাস্ক্রিপ্ট এর প্রয়োজনীয় অ্যারে মেথডসমূহ",
    "colorPref": "#f0db4f",
    "contents": [{
            "title": "অ্যারে প্রপার্টি",
            "items": [{
                    "definition": "constructor প্রপার্টি একটি অবজেক্ট এর জন্য \\\"Object() { [native code] }\\\" এবং একটি অ্যারে এর জন্য \\\"Array() { [native code] }\\\" রিটার্ন করে",
                    "code": "arr.constructor"
                },
                {
                    "definition": "length প্রপার্টি একটি অ্যারে এর মোট এলিমেন্ট সংখ্যা রিটার্ন করে",
                    "code": "arr.length"
                },
                {
                    "definition": "prototype কন্সট্রাক্টর একটি Array() অবজেক্ট এ নতুন প্রপার্টি এনং মেথড যুক্ত করে",
                    "code": "Array.prototype.myMethod()"
                }
            ]
        },
        {
            "title": "অ্যারে মেথড",
            "items": [{
                    "definition": "দুই বা ততধিক Array কে যুক্ত করে",
                    "code": "arr.concat(arr2)"
                },
                {
                    "definition": "অ্যারের উপাদানগুলোকে অ্যারের অন্য অবস্থানে কপি করে",
                    "code": "arr.copyWithin(1, 3)"
                },
                {
                    "definition": "উপাদান দিয়ে নতুন অ্যারে তৈরি",
                    "code": "arr.of('A', 'B', 'C')"
                },
                {
                    "definition": "একটি সম্পূর্ণ অ্যারে ইটারেট করে এবং অ্যারের ইনডেক্স নাম্বারের সাথে ভ্যালু রিটার্ন করে",
                    "code": "arr.entries()"
                },
                {
                    "definition": "একটি অ্যারের এলিমেন্ট কে অন্য একটি নির্দিষ্ট এলিমেন্ট দ্বারা পূরণ করে",
                    "code": "arr.fill('foo')"
                },
                {
                    "definition": "নির্দিষ্ট শর্ত অনুযায়ী অ্যারের এলিমেন্ট পরিক্ষা করে এবং ফলাফলের সাথে নতুন একটি অ্যারে রিটার্ন করে (provided as a function)",
                    "code": "arr.filter(myFunc)"
                },
                {
                    "definition": "প্রদত্ত শর্ত অনুযায়ী অ্যারের এলিমেন্টগুলো পরিক্ষা করে এবং ফলাফল হিসেবে বুলিয়ান ভ্যালু (true/false) রিটার্ন করে (provided as a function)",
                    "code": "arr.every(myFunc)"
                },
                {
                    "definition": "প্রদত্ত শর্ত অনুযায়ী অ্যারের এলিমেন্টগুলো পরিক্ষা করে এবং মিলে যাওয়া প্রথম এলিমেন্টের সাথে নতুন অ্যারে রিটার্ন করে (provided as a function)",
                    "code": "arr.find(myFunc)"
                },
                {
                    "definition": "প্রদত্ত শর্ত অনুযায়ী অ্যারের এলিমেন্টগুলো পরিক্ষা করে এবং মিলে যাওয়া প্রথম এলিমেন্টের ইনডেক্স নাম্বার রিটার্ন করে (provided as a function)",
                    "code": "arr.findIndex(myFunc)"
                },
                {
                    "definition": "অ্যারে এর প্রত্যেকটি এলিমেন্টের জন্য প্রদত্ত ফাংশন কোল করে এবং শর্ত অনুযায়ী ফলাফল রিটার্ন করে",
                    "code": "arr.forEach(myFunc)"
                },
                {
                    "definition": "অ্যারে এর মধ্যে একটি নির্দিষ্ট এলিমেন্ট অন্তর্ভুক্ত কিনা, তা নির্ধারন করে",
                    "code": "arr.includes('foo', 'bar')"
                },
                {
                    "definition": "অ্যারে তে একটি নির্দিষ্ট এলিমেন্ট খোঁজে এবং সেই এলিমেন্ট এর ইনডেক্স নাম্বার রিটার্ন করে",
                    "code": "arr.indexOf('foo')"
                },
                {
                    "definition": "একটি অবজেক্ট অ্যারে কিনা তা নির্ধারন করে এবং বুলিয়ান (true/false) ভ্যালু প্রদর্শন করে",
                    "code": "Array.isArray(arr)"
                },
                {
                    "definition": "অ্যারে এর এলিমেন্টগুলোকে একসাথে যুক্ত করে, স্ট্রীং এ রূপান্তর করে",
                    "code": "arr.join(' ')"
                },
                {
                    "definition": "অ্যারে ইটারেট করে এবং নির্দিষ্ট একটি এলিমেন্ট এর ইনডেক্স নাম্বার রিটার্ন করে",
                    "code": "arr.lastIndexOf('foo')"
                },
                {
                    "definition": "প্রতিটি অ্যারে উপাদানের জন্য প্রদত্ত ফাংশন কোল করে এবং ফলাফল সহ একটি নতুন অ্যারে তৈরি করে",
                    "code": "arr.map(myFunc)"
                },
                {
                    "definition": "একটি অ্যারে এর শেষের এলিমেন্টটি রিমুভ করে",
                    "code": "arr.pop()"
                },
                {
                    "definition": "একটি অ্যারে এর শেষে নতুন এলিমেন্ট যুক্ত করে",
                    "code": "arr.push('foo')"
                },
                {
                    "definition": "অ্যারে ইটারেট করে (from left-to-right) এবং সেটিকে সংকুচিত করে একটি একক ভ্যালুতে রূপান্তর করে, ফাংশনের রিটার্ন ভ্যালু একটি একুমুলেটরে সংরক্ষিত হয়",
                    "code": "arr.reduce(myFunc, 0)"
                },
                {
                    "definition": "অ্যারে ইটারেট করে (from right-to-left) এবং সেটিকে সংকুচিত করে একটি একক ভ্যালুতে রূপান্তর করে",
                    "code": "arr.reduceRight(myFunc)"
                },
                {
                    "definition": "একটি অ্যারে এর এলিমেন্টগুলোকে ক্রম বিপরীত রূপ দেয়",
                    "code": "arr.reverse()"
                },
                {
                    "definition": "অ্যারে এর প্রত্যেকটি এলিমেন্টএ র জন্য প্রদত্ত ফাংশন এক্সিকিউট করে এবং সত্যতা প্রদর্শন করে",
                    "code": "arr.some(myFunc)"
                },
                {
                    "definition": "প্রদত্ত প্রথম ও শেষ আর্গুমেন্ট অনুযায়ী একটি অ্যারে এর এলিমেন্টগুলো কর্তন করে নতুন একটি অ্যারে তে ফলাফল প্রদর্শন করে",
                    "code": "arr.slice(1, 3)"
                },
                {
                    "definition": "একটি অ্যারে এর প্রথম এলিমেন্টটি রিমুভ করে",
                    "code": "arr.shift()"
                },
                {
                    "definition": "অ্যারে এর এলিমেন্টগুলোকে ক্রমানুসারে সাজায়",
                    "code": "arr.sort()"
                },
                {
                    "definition": "প্রদত্ত ইনডেক্স অনুযায়ী অ্যারে তে নতুন এলিমেন্ট যুক্ত করে অথবা বাদ দেয়",
                    "code": "arr.splice(3, 1, 'foo', 'bar')"
                },
                {
                    "definition": "অ্যারে এর প্রত্যেক এলিমেন্টকে স্ট্রিং এ কনভার্ট করে এবং কমা (,) দ্বারা বিভক্ত করে",
                    "code": "arr.toString()"
                },
                {
                    "definition": "অ্যারে এর শুরুতে নতুন এলিমেন্ট যুক্ত করে",
                    "code": "arr.unshift('foo', 'bar')"
                },
                {
                    "definition": "পূর্বের ন্যায় একই অ্যারে রিটার্ন করে",
                    "code": "arr.valueOf()"
                }
            ]
        }
    ]
}
